app/controllers/recipes_controller.rb

SELECT `recipes`.* FROM `recipes`   ORDER BY created_at DESC
---
	def index
		@recipe = Recipe.all.order("created_at DESC")

SELECT  `recipes`.* FROM `recipes`  WHERE `recipes`.`id` = 1 LIMIT 1
---
	def show
		@recipe = Recipe.find(params[:id])

SELECT  `recipes`.* FROM `recipes`  WHERE `recipes`.`id` = 2 LIMIT 1
---
	def edit
		@recipe = Recipe.find(params[:id])

INSERT INTO `recipes` (`created_at`, `description`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `preparation`, `title`, `updated_at`) VALUES ('2015-01-13 07:15:12', 'Easy and tasty recipe for Navratan Korma or Navaratna Kurma.\r\n', 'image/jpeg', 'navratan-korma.jpg', 478163, '2015-01-13 07:15:08', 'Ingredients: 2 cups of diced, mixed vegetables - I used carrot, beans, peas, corn and potato (cauliflower will be nice too!) A few cubes of paneer 10 cashew nuts and 10 raisins soaked in warm water, drained and ground to a paste 1 large onion, minced 1 to', 'Navratna Kurma', '2015-01-13 07:15:12')
---
	def create
		@recipe=Recipe.new(show_params)
		if @recipe.save

SELECT  `recipes`.* FROM `recipes`  WHERE `recipes`.`id` = 2 LIMIT 1
UPDATE `recipes` SET `image_content_type` = 'image/jpeg', `image_file_name` = 'idly-vada.jpg', `image_file_size` = 541914, `image_updated_at` = '2014-12-23 09:07:15', `updated_at` = '2014-12-23 09:07:19' WHERE `recipes`.`id` = 7
---
	def update
		@recipe = Recipe.find(params[:id])
		if @recipe.update_attributes(show_params)

SELECT  `recipes`.* FROM `recipes`  WHERE `recipes`.`id` = 3 LIMIT 1
DELETE FROM `recipes` WHERE `recipes`.`id` = 3
---
	def destroy
		@recipe = Recipe.find(params[:id])
		@recipe.destroy